Запросы.ПростоКоннектор/src/Catalogs/ПравилаЗагрузкиДанных/ПравилаЗагрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаЗагрузкиДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПравилаОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняемыйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыВыгрузки</types>
    </type>
  </attributes>
</mdclass:Catalog>

Запросы.ПростоКоннектор/src/Catalogs/ПравилаЗагрузкиДанных/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// <Описание функции>
//
// Параметры:
//   КодПравила - Строка, код правила отправителя
//
// Возвращаемое значение:
//	Массив найденных правил   
//
Функция ПравилаЗагрузки(КодПравила) Экспорт
	
	Ответ = Новый Массив;
	
	Если ЗначениеЗаполнено(КодПравила) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Спр.Наименование КАК ПравилоЗагрузки,
		               |	Спр.ИсполняемыйКод КАК ИсполняемыйКод,
		               |	Спр.ВариантЗагрузки КАК ВариантЗагрузки
		               |ИЗ
		               |	Справочник.ПравилаЗагрузкиДанных КАК Спр
		               |ГДЕ
		               |	Спр.КодПравилаОтправителя = &КодПравила
		               |	И НЕ Спр.ПометкаУдаления
		               |	И Спр.Активно";
		Запрос.УстановитьПараметр("КодПравила", КодПравила);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Структура = Новый Структура("ПравилоЗагрузки, ИсполняемыйКод, ВариантЗагрузки");
				ЗаполнитьЗначенияСвойств(Структура, Выборка);
				Ответ.Добавить(Структура);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// <Описание процедуры>
//
// Параметры:
//   Процедура не принимает параметров.
//
// Описание выполнения:
//   - Вызывает обработку входящего сообщения.
//   - Подготавливает набор правил для дальнейшей загрузки данных.
//
Процедура ПолучитьКодЗагрузкиОбъекта(ВходящееСообщение, ИсполняемыйКод, СтруктураОбъекта) Экспорт

	ОбработатьВходящееСообщение(ВходящееСообщение, ИсполняемыйКод, СтруктураОбъекта);	

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОбработатьВходящееСообщение(ВходящееСообщение, ИсполняемыйКод, СтруктураОбъекта)
    Попытка
	   // Пытаемся прочитать как JSON
	  СтруктураОбъекта = Коннектор_БиблиотекаФункций.ПрочитатьТелоСообщенияJSON(ВходящееСообщение);		
	  Если Не СтруктураОбъекта.Свойство("ObjectType") Тогда
		  ЗаписьЖурналаРегистрации("ПравилаЗагрузкиДанных.ОбработатьВходящееСообщение",
		  УровеньЖурналаРегистрации.Ошибка, , ВходящееСообщение,
		  "Не указан ObjectType, правило не найдено");
		  Возврат;
	  КонецЕсли;
	  
	  ИмяМетаданных = Коннектор_БиблиотекаФункций.ПолучитьИмяМетаданныхИзСтроки(СтруктураОбъекта.ObjectType);
	  
	  Коннектор_БиблиотекаФункцийПовтИсп.ПолучитьНастройкиЗагрузкиБаз(ИмяМетаданных, ИсполняемыйКод);
	Исключение
	    // Пытаемся прочитать как xml
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
